MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAA169/mcu.h
extern volatile __SBT16WR1bits_t SBT16WR1bits __asm__ ("SBT16WR1") __attribute__((section("sfrs"), address(0xBF92C478)));
#define SBT16REG2 SBT16REG2
extern volatile uint32_t   SBT16REG2 __attribute__((section("sfrs"), address(0xBF92C480)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT16REG2bits_t;
extern volatile __SBT16REG2bits_t SBT16REG2bits __asm__ ("SBT16REG2") __attribute__((section("sfrs"), address(0xBF92C480)));
#define SBT16RD2 SBT16RD2
extern volatile uint32_t   SBT16RD2 __attribute__((section("sfrs"), address(0xBF92C490)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16RD2bits_t;
extern volatile __SBT16RD2bits_t SBT16RD2bits __asm__ ("SBT16RD2") __attribute__((section("sfrs"), address(0xBF92C490)));
#define SBT16WR2 SBT16WR2
extern volatile uint32_t   SBT16WR2 __attribute__((section("sfrs"), address(0xBF92C498)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16WR2bits_t;
extern volatile __SBT16WR2bits_t SBT16WR2bits __asm__ ("SBT16WR2") __attribute__((section("sfrs"), address(0xBF92C498)));
#define SBT16REG3 SBT16REG3
extern volatile uint32_t   SBT16REG3 __attribute__((section("sfrs"), address(0xBF92C4A0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT16REG3bits_t;
extern volatile __SBT16REG3bits_t SBT16REG3bits __asm__ ("SBT16REG3") __attribute__((section("sfrs"), address(0xBF92C4A0)));
#define SBT16RD3 SBT16RD3
extern volatile uint32_t   SBT16RD3 __attribute__((section("sfrs"), address(0xBF92C4B0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16RD3bits_t;
extern volatile __SBT16RD3bits_t SBT16RD3bits __asm__ ("SBT16RD3") __attribute__((section("sfrs"), address(0xBF92C4B0)));
#define SBT16WR3 SBT16WR3
extern volatile uint32_t   SBT16WR3 __attribute__((section("sfrs"), address(0xBF92C4B8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16WR3bits_t;
extern volatile __SBT16WR3bits_t SBT16WR3bits __asm__ ("SBT16WR3") __attribute__((section("sfrs"), address(0xBF92C4B8)));
#define SBT16REG4 SBT16REG4
extern volatile uint32_t   SBT16REG4 __attribute__((section("sfrs"), address(0xBF92C4C0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT16REG4bits_t;
extern volatile __SBT16REG4bits_t SBT16REG4bits __asm__ ("SBT16REG4") __attribute__((section("sfrs"), address(0xBF92C4C0)));
#define SBT16RD4 SBT16RD4
extern volatile uint32_t   SBT16RD4 __attribute__((section("sfrs"), address(0xBF92C4D0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16RD4bits_t;
extern volatile __SBT16RD4bits_t SBT16RD4bits __asm__ ("SBT16RD4") __attribute__((section("sfrs"), address(0xBF92C4D0)));
#define SBT16WR4 SBT16WR4
extern volatile uint32_t   SBT16WR4 __attribute__((section("sfrs"), address(0xBF92C4D8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT16WR4bits_t;
extern volatile __SBT16WR4bits_t SBT16WR4bits __asm__ ("SBT16WR4") __attribute__((section("sfrs"), address(0xBF92C4D8)));
#define USBIE0CSR0 USBIE0CSR0
extern volatile uint32_t   USBIE0CSR0 __attribute__((section("sfrs"), address(0xBF8E3010)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t :5;
    uint32_t RXRDY:1;
    uint32_t TXRDY:1;
    uint32_t STALLED:1;
    uint32_t SETUP:1;
    uint32_t ERROR:1;
    uint32_t REQPKT:1;
    uint32_t STATUS:1;
    uint32_t NAKTO:1;
    uint32_t FLUSH:1;
    uint32_t DT:1;
    uint32_t DTWE:1;
  };
  struct {
    uint32_t :19;
    uint32_t DATAEND:1;
    uint32_t SETEND:1;
    uint32_t STALL:1;
    uint32_t RXRDYC:1;
    uint32_t SETENDC:1;
  };
} __USBIE0CSR0bits_t;
extern volatile __USBIE0CSR0bits_t USBIE0CSR0bits __asm__ ("USBIE0CSR0") __attribute__((section("sfrs"), address(0xBF8E3010)));
#define USBIENCSR0 USBIENCSR0
extern volatile uint32_t   USBIENCSR0 __attribute__((section("sfrs"), address(0xBF8E3010)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t MULT:5;
    uint32_t TXPKTRDY:1;
    uint32_t FIFONE:1;
    uint32_t ERROR:1;
    uint32_t FLUSH:1;
    uint32_t SETUPPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t NAKTMOUT:1;
    uint32_t DATATGGL:1;
    uint32_t DTWREN:1;
    uint32_t DMAREQMD:1;
    uint32_t FRCDATTG:1;
    uint32_t DMAREQEN:1;
    uint32_t MODE:1;
    uint32_t :1;
    uint32_t AUTOSET:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBIENCSR0bits_t;
extern volatile __USBIENCSR0bits_t USBIENCSR0bits __asm__ ("USBIENCSR0") __attribute__((section("sfrs"), address(0xBF8E3010)));
#define USBIE0CSR2 USBIE0CSR2
extern volatile uint32_t   USBIE0CSR2 __attribute__((section("sfrs"), address(0xBF8E3018)));
typedef struct {
  uint32_t RXCNT:7;
  uint32_t :15;
  uint32_t SPEED:2;
  uint32_t NAKLIM:4;
} __USBIE0CSR2bits_t;
extern volatile __USBIE0CSR2bits_t USBIE0CSR2bits __asm__ ("USBIE0CSR2") __attribute__((section("sfrs"), address(0xBF8E3018)));
#define USBIENCSR2 USBIENCSR2
extern volatile uint32_t   USBIENCSR2 __attribute__((section("sfrs"), address(0xBF8E3018)));
typedef struct {
  uint32_t RXCNT:14;
  uint32_t :2;
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t TXINTERV:8;
} __USBIENCSR2bits_t;
extern volatile __USBIENCSR2bits_t USBIENCSR2bits __asm__ ("USBIENCSR2") __attribute__((section("sfrs"), address(0xBF8E3018)));
#define USBIE0CSR3 USBIE0CSR3
extern volatile uint32_t   USBIE0CSR3 __attribute__((section("sfrs"), address(0xBF8E301C)));
typedef struct {
  uint32_t :24;
  uint32_t UTMIDWID:1;
  uint32_t SOFTCONE:1;
  uint32_t DYNFIFOS:1;
  uint32_t HBTXEN:1;
  uint32_t HBRXEN:1;
  uint32_t BIGEND:1;
  uint32_t MPTXEN:1;
  uint32_t MPRXEN:1;
} __USBIE0CSR3bits_t;
extern volatile __USBIE0CSR3bits_t USBIE0CSR3bits __asm__ ("USBIE0CSR3") __attribute__((section("sfrs"), address(0xBF8E301C)));
#define USBIENCSR3 USBIENCSR3
extern volatile uint32_t   USBIENCSR3 __attribute__((section("sfrs"), address(0xBF8E301C)));
typedef struct {
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t RXINTERV:8;
  uint32_t :8;
  uint32_t TXFIFOSZ:4;
  uint32_t RXFIFOSZ:4;
} __USBIENCSR3bits_t;
