MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAA169/mcu.h
#define _CNNEJ_CNNEJ14_POSITION                  0x0000000E
#define _CNNEJ_CNNEJ14_MASK                      0x00004000
#define _CNNEJ_CNNEJ14_LENGTH                    0x00000001

#define _CNNEJ_CNNEJ15_POSITION                  0x0000000F
#define _CNNEJ_CNNEJ15_MASK                      0x00008000
#define _CNNEJ_CNNEJ15_LENGTH                    0x00000001

#define _CNFJ_CNFJ0_POSITION                     0x00000000
#define _CNFJ_CNFJ0_MASK                         0x00000001
#define _CNFJ_CNFJ0_LENGTH                       0x00000001

#define _CNFJ_CNFJ1_POSITION                     0x00000001
#define _CNFJ_CNFJ1_MASK                         0x00000002
#define _CNFJ_CNFJ1_LENGTH                       0x00000001

#define _CNFJ_CNFJ2_POSITION                     0x00000002
#define _CNFJ_CNFJ2_MASK                         0x00000004
#define _CNFJ_CNFJ2_LENGTH                       0x00000001

#define _CNFJ_CNFJ3_POSITION                     0x00000003
#define _CNFJ_CNFJ3_MASK                         0x00000008
#define _CNFJ_CNFJ3_LENGTH                       0x00000001

#define _CNFJ_CNFJ4_POSITION                     0x00000004
#define _CNFJ_CNFJ4_MASK                         0x00000010
#define _CNFJ_CNFJ4_LENGTH                       0x00000001

#define _CNFJ_CNFJ5_POSITION                     0x00000005
#define _CNFJ_CNFJ5_MASK                         0x00000020
#define _CNFJ_CNFJ5_LENGTH                       0x00000001

#define _CNFJ_CNFJ6_POSITION                     0x00000006
#define _CNFJ_CNFJ6_MASK                         0x00000040
#define _CNFJ_CNFJ6_LENGTH                       0x00000001

#define _CNFJ_CNFJ7_POSITION                     0x00000007
#define _CNFJ_CNFJ7_MASK                         0x00000080
#define _CNFJ_CNFJ7_LENGTH                       0x00000001

#define _CNFJ_CNFJ8_POSITION                     0x00000008
#define _CNFJ_CNFJ8_MASK                         0x00000100
#define _CNFJ_CNFJ8_LENGTH                       0x00000001

#define _CNFJ_CNFJ9_POSITION                     0x00000009
#define _CNFJ_CNFJ9_MASK                         0x00000200
#define _CNFJ_CNFJ9_LENGTH                       0x00000001

#define _CNFJ_CNFJ10_POSITION                    0x0000000A
#define _CNFJ_CNFJ10_MASK                        0x00000400
#define _CNFJ_CNFJ10_LENGTH                      0x00000001

#define _CNFJ_CNFJ11_POSITION                    0x0000000B
#define _CNFJ_CNFJ11_MASK                        0x00000800
#define _CNFJ_CNFJ11_LENGTH                      0x00000001

#define _CNFJ_CNFJ12_POSITION                    0x0000000C
#define _CNFJ_CNFJ12_MASK                        0x00001000
#define _CNFJ_CNFJ12_LENGTH                      0x00000001

#define _CNFJ_CNFJ13_POSITION                    0x0000000D
#define _CNFJ_CNFJ13_MASK                        0x00002000
#define _CNFJ_CNFJ13_LENGTH                      0x00000001

#define _CNFJ_CNFJ14_POSITION                    0x0000000E
#define _CNFJ_CNFJ14_MASK                        0x00004000
#define _CNFJ_CNFJ14_LENGTH                      0x00000001

#define _CNFJ_CNFJ15_POSITION                    0x0000000F
#define _CNFJ_CNFJ15_MASK                        0x00008000
#define _CNFJ_CNFJ15_LENGTH                      0x00000001

#define _SRCON0J_SR0J0_POSITION                  0x00000000
#define _SRCON0J_SR0J0_MASK                      0x00000001
#define _SRCON0J_SR0J0_LENGTH                    0x00000001

#define _SRCON0J_SR0J1_POSITION                  0x00000001
#define _SRCON0J_SR0J1_MASK                      0x00000002
#define _SRCON0J_SR0J1_LENGTH                    0x00000001

#define _SRCON0J_SR0J2_POSITION                  0x00000002
#define _SRCON0J_SR0J2_MASK                      0x00000004
#define _SRCON0J_SR0J2_LENGTH                    0x00000001

#define _SRCON0J_SR0J3_POSITION                  0x00000003
#define _SRCON0J_SR0J3_MASK                      0x00000008
#define _SRCON0J_SR0J3_LENGTH                    0x00000001

#define _SRCON0J_SR0J4_POSITION                  0x00000004
#define _SRCON0J_SR0J4_MASK                      0x00000010
#define _SRCON0J_SR0J4_LENGTH                    0x00000001

#define _SRCON0J_SR0J5_POSITION                  0x00000005
#define _SRCON0J_SR0J5_MASK                      0x00000020
#define _SRCON0J_SR0J5_LENGTH                    0x00000001

#define _SRCON0J_SR0J6_POSITION                  0x00000006
#define _SRCON0J_SR0J6_MASK                      0x00000040
#define _SRCON0J_SR0J6_LENGTH                    0x00000001

#define _SRCON0J_SR0J7_POSITION                  0x00000007
#define _SRCON0J_SR0J7_MASK                      0x00000080
#define _SRCON0J_SR0J7_LENGTH                    0x00000001

#define _SRCON0J_SR0J8_POSITION                  0x00000008
#define _SRCON0J_SR0J8_MASK                      0x00000100
#define _SRCON0J_SR0J8_LENGTH                    0x00000001

#define _SRCON0J_SR0J9_POSITION                  0x00000009
#define _SRCON0J_SR0J9_MASK                      0x00000200
#define _SRCON0J_SR0J9_LENGTH                    0x00000001

#define _SRCON0J_SR0J10_POSITION                 0x0000000A
#define _SRCON0J_SR0J10_MASK                     0x00000400
#define _SRCON0J_SR0J10_LENGTH                   0x00000001

#define _SRCON0J_SR0J11_POSITION                 0x0000000B
#define _SRCON0J_SR0J11_MASK                     0x00000800
#define _SRCON0J_SR0J11_LENGTH                   0x00000001

#define _SRCON0J_SR0J12_POSITION                 0x0000000C
#define _SRCON0J_SR0J12_MASK                     0x00001000
#define _SRCON0J_SR0J12_LENGTH                   0x00000001

#define _SRCON0J_SR0J13_POSITION                 0x0000000D
#define _SRCON0J_SR0J13_MASK                     0x00002000
#define _SRCON0J_SR0J13_LENGTH                   0x00000001

#define _SRCON0J_SR0J14_POSITION                 0x0000000E
#define _SRCON0J_SR0J14_MASK                     0x00004000
#define _SRCON0J_SR0J14_LENGTH                   0x00000001

#define _SRCON0J_SR0J15_POSITION                 0x0000000F
#define _SRCON0J_SR0J15_MASK                     0x00008000
#define _SRCON0J_SR0J15_LENGTH                   0x00000001

#define _SRCON1J_SR1J0_POSITION                  0x00000000
#define _SRCON1J_SR1J0_MASK                      0x00000001
#define _SRCON1J_SR1J0_LENGTH                    0x00000001

#define _SRCON1J_SR1J1_POSITION                  0x00000001
#define _SRCON1J_SR1J1_MASK                      0x00000002
#define _SRCON1J_SR1J1_LENGTH                    0x00000001

#define _SRCON1J_SR1J2_POSITION                  0x00000002
#define _SRCON1J_SR1J2_MASK                      0x00000004
#define _SRCON1J_SR1J2_LENGTH                    0x00000001

#define _SRCON1J_SR1J3_POSITION                  0x00000003
#define _SRCON1J_SR1J3_MASK                      0x00000008
#define _SRCON1J_SR1J3_LENGTH                    0x00000001

